//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
// Mission objects
//===========================================================================================================================
// MissionEnvSound	
//============================================================================================

#ifndef _MissionEnvSound_h_
#define _MissionEnvSound_h_

#include "MissionSoundBase.h"

class MissionEnvSound : public MissionSoundBase  
{
//--------------------------------------------------------------------------------------------
public:
	MissionEnvSound();
	virtual ~MissionEnvSound();

//--------------------------------------------------------------------------------------------
public:
	//Инициализировать объект
	virtual bool Create(MOPReader & reader);

//--------------------------------------------------------------------
public:
	//Инициализировать объект
	virtual bool EditMode_Create(MOPReader & reader);
	//Обновить параметры
	virtual bool EditMode_Update(MOPReader & reader);

};

#endif

