//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
//
//===========================================================================================================================
// AnxCmd_Import
//============================================================================================


#include "AnxCmd_Import.h"

//============================================================================================

AnxCmd_Import::AnxCmd_Import(AnxOptions & options) : AnxCmd_Paste(options)
{

}

AnxCmd_Import::~AnxCmd_Import()
{

}


//============================================================================================

bool AnxCmd_Import::IsEnable()
{
	if(!opt.project) return false;
	return true;
}

void AnxCmd_Import::Do()
{
	//Сохраняем данные в буфере для операций анду-реду
	SaveSelectedNodes();
}

Command * AnxCmd_Import::CreateThisObject(AnxOptions & opt)
{
	return NEW AnxCmd_Import(opt);
}


