//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
//
//===========================================================================================================================
// AnxCmd_Paste
//============================================================================================

#ifndef _AnxCmd_Paste_h_
#define _AnxCmd_Paste_h_

#include "Command.h"

class AnxCmd_Paste : public Command
{
//--------------------------------------------------------------------------------------------
public:
	AnxCmd_Paste(AnxOptions & options);
	virtual ~AnxCmd_Paste();

//--------------------------------------------------------------------------------------------
public:
	virtual bool IsEnable();
	virtual bool CanUndo();
	virtual void Do();
	virtual void UnDo();
	virtual void ReDo();
	virtual Command * CreateThisObject(AnxOptions & opt);

//--------------------------------------------------------------------------------------------
protected:
	//Сохранить выделенные ноды с текущего уровня в локальном буфере для операций отмены-повтора
	void SaveSelectedNodes();

//--------------------------------------------------------------------------------------------
private:
	AnxStreamMemory data;
	array<string> nodes;
};

#endif

