//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
// Mission objects
//===========================================================================================================================
// Light	
//============================================================================================

#ifndef _Light_h_
#define _Light_h_

#include "..\..\..\Common_h\mission\Mission.h"

class Light : public MissionObject  
{
//--------------------------------------------------------------------------------------------
public:
	Light();
	virtual ~Light();


	MO_IS_FUNCTION(Light, MissionObject);


//--------------------------------------------------------------------
public:
	//Инициализировать объект
	virtual bool EditMode_Create(MOPReader & reader);
	//Обновить параметры
	virtual bool EditMode_Update(MOPReader & reader);
	//Получить размеры описывающего ящика
	virtual void EditMode_GetSelectBox(Vector & min, Vector & max);

//--------------------------------------------------------------------------------------------
protected:
	//Создать модельку
	void CreateModel(const char * name);

	//Рисование модельки в режиме редактирования
	virtual void _cdecl EditModeDraw(float dltTime, long level);


//--------------------------------------------------------------------------------------------
protected:
	//Моделька отображающая источник освещения
	IGMXScene * model;
	//Цвет источника
	Color color;
};

#endif

