//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
// 
//===========================================================================================================================
// GraphNodeOut	
//============================================================================================

#ifndef _GraphNodeOut_h_
#define _GraphNodeOut_h_

#include "GraphNodeInOut.h"

class GraphNodeOut : public GraphNodeInOut  
{
//--------------------------------------------------------------------------------------------
public:
	GraphNodeOut(AnxOptions & options);
	virtual ~GraphNodeOut();

//--------------------------------------------------------------------------------------------
public:
	//Нарисовать нод
	virtual void Draw(const GUIPoint & pos, IRender * render, GUICliper & clipper);
	//Проверить поподание в нод
	virtual bool Inside(const GUIPoint & pnt);
	//Активировать
	virtual void Activate();

	//Получить тип нода
	virtual AnxNodeTypes GetType();

//--------------------------------------------------------------------------------------------
private:



};

#endif

