//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
// 
//===========================================================================================================================
// GraphLink	
//============================================================================================

#ifndef _GraphLink_h_
#define _GraphLink_h_

#include "..\AnxBase.h"
#include "LinkData.h"

class GraphNodeBase;

class GraphLink
{
//--------------------------------------------------------------------------------------------
public:
	GraphLink(AnxOptions & options, GraphNodeBase * _from, GraphNodeBase * _to);
	virtual ~GraphLink();

//--------------------------------------------------------------------------------------------
public:
	//Активировать линк
	void Activate();

	//Записать данные в поток
	void Write(AnxStream & stream);
	//Прочитать данные из потока
	void Read(AnxStream & stream);

//--------------------------------------------------------------------------------------------
public:
	AnxOptions & opt;		//Опции
	GraphNodeBase * from;	//От этого нода
	GraphNodeBase * to;		//к этому ноду
	bool fake;				//Линк испульзуется для промежуточного соединения
	bool select;			//Выделение
	LinkData data;			//Данные линка
	string fromONode;		//С какого нода
	string toINode;			//На какой нод
};

#endif

