//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
// 
//===========================================================================================================================
// GraphNodeHierarchy	
//============================================================================================

#ifndef _GraphNodeHierarchy_h_
#define _GraphNodeHierarchy_h_

#include "GraphNodeBase.h"

class GraphNodeHierarchy : public GraphNodeBase  
{
//--------------------------------------------------------------------------------------------
public:
	GraphNodeHierarchy(AnxOptions & options);
	virtual ~GraphNodeHierarchy();

//--------------------------------------------------------------------------------------------
public:
	//Нарисовать нод
	virtual void Draw(const GUIPoint & pos, IRender * render, GUICliper & clipper);
	//Активировать
	virtual void Activate();

	//Нормальный линк подходит к ноду или фейковый
	virtual bool IsFakeLink();

	//Получить тип нода
	virtual AnxNodeTypes GetType();

//--------------------------------------------------------------------------------------------
private:



};

#endif

