//===========================================================================================================================
// Spirenkov Maxim, 2003
//===========================================================================================================================//	
// AnxEditor
//===========================================================================================================================
// LinkData	
//============================================================================================

#ifndef _LinkData_h_
#define _LinkData_h_


#include "..\AnxBase.h"


class LinkData
{
//--------------------------------------------------------------------------------------------
public:
	LinkData();
	~LinkData();

//--------------------------------------------------------------------------------------------
public:

	//Записать данные в поток
	void Write(AnxStream & stream);
	//Прочитать данные из потока
	void Read(AnxStream & stream);


//--------------------------------------------------------------------------------------------
public:
	string name;			//Имя линка
	long aranges[2];		//Диапазон активации по кадрам
	long mranges[2];		//Диапазон перехода по кадрам
	float blendTime;		//Время блендинга
	float syncPos;			//Коэфициент синхронизации
	bool isSync;			//По этому линку переходить по умолчанию
	bool defaultLink;		//По этому линку переходить по умолчанию
};

#endif

