//================================================================================================================
//Управленние билдом
//================================================================================================================

#ifndef _Cfg_Switches_h_
#define _Cfg_Switches_h_


#define GAME_TITLE "Captain blood"

#define SIMD_ENABLE

#ifndef _XBOX
//Выбор модификации билда (можно выбирать только 1 пункт)
	//#define GAME_RUSSIAN
	//#define GAME_DEMO
#endif

//Отключение отладочных функций
#ifndef _DEBUG
//#define STOP_DEBUG
#endif

/*
//Если XBOX и не DEBUG и не PROFILE
#if defined(_XBOX) && !(defined (_DEBUG) || defined(PROFILE))
	#pragma message("Xbox360 Release - stop debug enabled.")
	#define STOP_DEBUG
#endif
*/

#ifdef STOP_DEBUG
//================================================================================================================
//Секция объявления дефайнов для прекращения вывода отладочной информации и выключения тулзов
//================================================================================================================


#define STOP_ASSERTS		//Отключить Assert и AssertE
#define STOP_LOGICTRACE		//Отключить возможность ведения лога для отладки логики
#define NO_CONSOLE			//Отключить возможность ведения лога для отладки логики
#define MM_NO_DEBUGMEMORY		//Отключить отладочную информацию в менеджере памяти
#define STOP_PROFILES		//Отключить профайлеры
#define NO_TOOLS			//Отключить возможность включения тулзов


//================================================================================================================
#else

#ifdef _XBOX
#define NO_TOOLS			//Отключить возможность включения тулзов
#endif

#endif


#endif


